using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Lesson14_3_Additional
{

    //1) Описать классы "Работник" и "Предприятие" позволяющие создавать работников, принимать, увольнять, изменять должность, переводить на другое предприятие, изменять зарплату.

    //2) Напишите программу "Парковка", в котрой опишите классы "Автомобиль" и "Стоянка".
    //Класс "Автомобиль" должен содержать информацию о машине:
    //Марку, Модель, Цвет, Номер, Время прибытия.
    //Добавьте возможность добавления машин на стоянку, просмотра информации о них и их вывоз.

    internal class Program
    {
        static void Main(string[] args)
        {
        }
    }
}
